//
//  Ansner.swift
//  PsychologicalTest
//
//  Created by Leo on 2020/12/9.
//

import Foundation

struct Answer {
    let answer = [
        "A":"你的感官可能比較敏銳，視覺、味覺、聽覺或是嗅覺常常比旁人更為靈敏。因為你能感受到最為單純、直白的感官感受，表現在愛情或是朋友關係中，往往讓人覺得你是一個體貼、細緻的人。你的個性單純，如果環境允許，就很容易成為樂天派，對周圍事物充滿興趣和好奇心，熱情、合群而且善於表達，也因此人緣總是很不錯。",
        "B":"你擁有自由的思想與無所不在的創意。你顯得要比同輩人成熟、穩重許多，你擅長思考，理智是你為人處世的首要原則。在周圍人眼中，你可能並不熱情，卻總是很有禮貌。你會適時地堅持自己的想法，不容易被外界環境左右，而且經常能運用創造性思維幫朋友解決各種問題。你沒有心機，也缺少些自我保護的能力，你的表面看來很容易相處，但想要走進你的內心世界其實並不容易。你需要人家的鼓勵、包容、寵愛和肯定，其實你也常常自我反省，希望自己能做到80%的完美，但你似乎沒有那種毅力，所以你有時的情緒比較變化無常，很有可能是被這些因素困擾。",
        "C":"你是積極努力的認真派，你對自己的要求很高，但是一旦遇到和你脾氣相似的人，你們就會有惺惺相惜的感覺，因而相談甚歡。你雖然表面看起來有些嚴肅，但是其實你單純、善良，想法總是積極正面。你有很強的自我調節能力，所以即使遇到困難，也能很好的處理。你常常給人的印象是充滿人情味和極具魅力，你的感受性很好，往往能夠明白一個人或是一件事中所蘊藏的深層含義。因此，你善解人意、對人對生活都滿含熱情，在自我表達時很少會掩飾，是好友之間理想的傾訴對象。",
        "D":"你是一個性格善良，但是固執而又堅持的人，喜歡天馬行空的與別人聊天，但不會主動找對方。你很有原則也很被動，總是習慣待在自己的世界裡。你在朋友眼裡是比較難深交的人，感覺你和人交往總是點到為止。",
        "E":"你單純沒有心機，喜歡為自己的朋友、親人付出，雖然表面上看起來漫不經心，實際上做事卻很有條理。一旦你想要做的事，就會做得很快、狠、準，只是你常常懶得做。你很喜歡說話、與別人交流意見，尤其是面對你自己有所瞭解的事。你的個性雖然比較好強，但是你的好強並不會給他人帶來困擾。",
        "F":"喜歡觀察所有事物的你，總是靜靜地看著周圍的一切。你的心思縝密、眼光獨到，能看出別人看不出的細節，你做事很有計劃，這讓朋友和你相處起來十分安心，因為你不僅能把自己處理得很穩妥，空閒時還能幫朋友做一些小事。你能掌握別人的想法，你很理智和現實，不喜歡天馬行空的亂想，覺得那樣是沒有意義的行為。"
    ]
}
